<?php
if (isset($_GET['bl'])) //Проверям была ли нажата кнопка заблокировать
{
	include ("bd.php");//Подключение к бд
	$bl=$_GET['bl']; //Присваиваем переменной значение - id выбранного пользователя для блокировки
	//если выбран не админ, то присваиваем пользователю статус 1(заблокирован)
	if ($bl != 6){
	mysqli_query($db, "UPDATE users SET status='1' WHERE id=$bl;");
	header('Location: /send.php'); // переадресовываем на главную страницу
	exit;
	}
	//если пользовател для блокировки - происходит редирект обратно на страницу с чатом
	else{
		header('Location: /send.php'); // переадресовываем на главную страницу
		exit;
	}
}
?>